Catalogs/сабМониторВнедрения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>сабМониторВнедрения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыДоставки</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/сабСоответствиеТиповДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>сабСоответствиеТиповДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ТипДокументаБУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДокументаУУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/сабМониторВнедрения/Forms/Форма3/Ext/Form/Module.bsl
&НаСервере
Процедура ВыполнитьАвтозаполение()
	
	УстановитьПривилегированныйРежим(Истина);

	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "РеализацияТоваровУслуг";
	НоваяЗапись.ТипДокументаУУ = "УЧ_Реализация";
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "ПоступлениеТоваровУслуг";
	НоваяЗапись.ТипДокументаУУ = "УЧ_ПоступлениеТоваров";
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "СписаниеТоваров";
	НоваяЗапись.ТипДокументаУУ = "УЧ_СписаниеТоваров";
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "ПередачаТоваров";
	НоваяЗапись.ТипДокументаУУ = "УЧ_СписаниеТоваров";
	НоваяЗапись.ВидОперацииБУ = Перечисления.ВидыОперацийПередачаТоваров.БезвозмезднаяПередача;
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "ПередачаТоваров";
	НоваяЗапись.ТипДокументаУУ = "УЧ_ПеремещениеМатериаловВПроизводство";
	НоваяЗапись.ВидОперацииБУ = Перечисления.ВидыОперацийПередачаТоваров.ВПереработку;
	НоваяЗапись.Записать();

	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "ПередачаМатериаловВЭксплуатацию";
	НоваяЗапись.ТипДокументаУУ = "УЧ_ПеремещениеМатериаловВПроизводство";
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "ТребованиеНакладная";
	НоваяЗапись.ТипДокументаУУ = "УЧ_ПеремещениеМатериаловВПроизводство";
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "ПеремещениеТоваров";
	НоваяЗапись.ТипДокументаУУ = "УЧ_ПеремещениеТоваров";
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "СписаниеСРасчетногоСчета";
	НоваяЗапись.ТипДокументаУУ = "УЧ_ДвижениеДС";
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "ОтчетПроизводстваЗаСмену";
	НоваяЗапись.ТипДокументаУУ = "УЧ_ВыпускПродукции";
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "ПоступлениеИзПереработки";
	НоваяЗапись.ТипДокументаУУ = "УЧ_ВыпускПродукции";
	НоваяЗапись.Записать();

	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "ПоступлениеНаРасчетныйСчет";
	НоваяЗапись.ТипДокументаУУ = "УЧ_ДвижениеДС";
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "ПриходныйКассовыйОрдер";
	НоваяЗапись.ТипДокументаУУ = "УЧ_ДвижениеДС";
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "РасходныйКассовыйОрдер";
	НоваяЗапись.ТипДокументаУУ = "УЧ_ДвижениеДС";
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "ОперацияБух";
	НоваяЗапись.ТипДокументаУУ = "УЧ_Операция";
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "РегламентнаяОперация";
	НоваяЗапись.ТипДокументаУУ = "Исключено";
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "РегламентнаяОперация";
	НоваяЗапись.ТипДокументаУУ = "УЧ_Операция";
	НоваяЗапись.ВидОперацииБУ = Перечисления.ВидыРегламентныхОпераций.РасчетНалогаНаПрибыль;
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "УведомлениеОбИсчисленныхСуммахНалогов";
	НоваяЗапись.ТипДокументаУУ = "Исключено";
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "ОперацияПоЕдиномуНалоговомуСчету";
	НоваяЗапись.ТипДокументаУУ = "Исключено";
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "ФормированиеЗаписейКнигиПокупок";
	НоваяЗапись.ТипДокументаУУ = "Исключено";
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "ФормированиеЗаписейКнигиПродаж";
	НоваяЗапись.ТипДокументаУУ = "Исключено";
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "СчетФактураВыданный";
	НоваяЗапись.ТипДокументаУУ = "Исключено";
	НоваяЗапись.Записать();

	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "СчетФактураПолученный";
	НоваяЗапись.ТипДокументаУУ = "Исключено";
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "АвансовыйОтчет";
	НоваяЗапись.ТипДокументаУУ = "УЧ_АвансовыйОтчет";
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "ВозвратТоваровОтПокупателя";
	НоваяЗапись.ТипДокументаУУ = "УЧ_Возврат";
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "ВозвратТоваровПоставщику";
	НоваяЗапись.ТипДокументаУУ = "УЧ_ВозвратТоваровПоставщику";
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "КорректировкаПоступления";
	НоваяЗапись.ТипДокументаУУ = "УЧ_КорректировкаПоступления";
	НоваяЗапись.Записать();

	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "ОприходованиеТоваров";
	НоваяЗапись.ТипДокументаУУ = "УЧ_ОприходованиеТоваров";
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "НачислениеЗарплаты";
	НоваяЗапись.ТипДокументаУУ = "УЧ_НачислениеЗП";
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "ОтражениеЗарплатыВБухучете";
	НоваяЗапись.ТипДокументаУУ = "УЧ_НачислениеЗП";
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "ВедомостьНаВыплатуЗарплаты";
	НоваяЗапись.ТипДокументаУУ = "УЧ_ВыплатаЗП";
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "ВедомостьНаВыплатуЗарплатыВБанк";
	НоваяЗапись.ТипДокументаУУ = "УЧ_ВыплатаЗП";
	НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "ВедомостьНаВыплатуЗарплатыВКассу";
	НоваяЗапись.ТипДокументаУУ = "УЧ_ВыплатаЗП";
	НоваяЗапись.Записать();

	
	//НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	//НоваяЗапись.ТипДокументаБУ = "КорректировкаРеализации";
	//НоваяЗапись.ТипДокументаУУ = "УЧ_КорректировкаРеализации";
	//НоваяЗапись.Записать();
	
	//НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	//НоваяЗапись.ТипДокументаБУ = "НачислениеДивидендов";
	//НоваяЗапись.ТипДокументаУУ = "Исключено";
	//НоваяЗапись.Записать();
	
	НоваяЗапись = РегистрыСведений.сабСоответствиеТиповДокументов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТипДокументаБУ = "ПрочиеДокументы";
	НоваяЗапись.ТипДокументаУУ = "УЧ_Операция";
	НоваяЗапись.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтруктуруПредприятия(Команда)
	ОткрытьФорму("РегистрСведений.сабСоответствиеТиповДокументов.ФормаСписка",,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Автонастройка(Команда)
	ВыполнитьАвтозаполение();
	Объект.Выполнено = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиТайминга(Команда)
	ОткрытьФорму("Справочник.СабНастройкиТайминга.ФормаСписка");
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьСтатусыНастроек", Новый Структура("Ссылка, Наименование, Выполнено", Объект.Ссылка, Объект.Наименование, Объект.Выполнено));
КонецПроцедуры
